app/controllers/libraries_controller.rb

INSERT INTO "libraries" ("Book_Id", "Book_Title", "Book_Author", "Book_Publisher", "year", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # @library = Library.new(library_params)
    @library = current_user.libraries.build(library_params)

    respond_to do |format|
      if @library.save

UPDATE "libraries" SET "Book_Title" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["Book_Title", "Let Us"], ["updated_at", "2021-11-13 03:20:53.640109"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @library.update(library_params)

DELETE FROM "libraries" WHERE "libraries"."id" = ?  [["id", 4]]
---
  def destroy
    @library.destroy

SELECT "libraries".* FROM "libraries" WHERE "libraries"."user_id" = ? AND "libraries"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
---
  def correct_user
    @library = current_user.libraries.find_by(id:params[:id])

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_library
      @library = Library.find(params[:id])